# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # used for ls/ll
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Meema
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.1'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'starship'

# Apps
cask '1password'
cask 'arc'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'mediainfo'
cask 'muzzle'
cask 'notion'
cask 'phpmon'
cask 'ray'
cask 'raycast'
cask 'setapp'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'

# Fonts
cask 'font-inter'
cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'AdBlock', id: 1402042596
mas 'Grammarly for Safari', id: 1462114288
mas 'Honey', id: 1472777122
mas 'Wappalyzer', id: 1520333300
mas 'WhatsApp', id: 1147396723
