# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'git'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Meema
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Apps
cask '1password'
cask 'arc'
cask 'cursor'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'github'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'mediainfo'
cask 'muzzle'
cask 'ray'
cask 'raycast'
cask 'readdle-spark'
cask 'rewind'
cask 'setapp'
cask 'slack'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'

# Fonts
cask 'font-inter'
cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'AdBlock', id: 1402042596
mas 'Grammarly for Safari', id: 1462114288
mas 'Honey', id: 1472777122
mas 'Wappalyzer', id: 1520333300
mas 'WhatsApp', id: 1147396723
